# 칸토어 비트열이라는 단어를 난생 처음 들어봄
# 0번째 칸토어 비트열은 1
# 1번째 칸토어 비트열은 11011
# 2번째 칸토어 비트열은 11011 11011 00000 11011 11011
# 이게 계속 반복
# 즉 수열로 치면 항상 첫 번째랑 2번째는 11011 그 다음은 00000 그 뒤 4번째랑 5번째는 11011 이게 반복
# 중간은 00000 이게 반복
# 1일 때는 11011
# 2일 때는 11011 첫째 둘째, 00000셋째, 11011 넷째 다섯째
# 3일 때는 11011 첫째 둘째, 00000셋째, 11011 넷째 다섯째
# 그 뒤 한 번 더 해서 10번째 까지는 똑같고
# 그뒤 00000으로 11번째부터 15번째 까지
# 그뒤 11011 다시 패턴 따라서 반복
# n = 0일 때 1개 n= 1일 때 5개 n=2일 때 25개 즉 n = 3일 떄 125개
# 전체 길이는 5^n승인데 5^20은 25^10 625^5 40000^2 * 625 = 몇 천억 정도
# 그러므로 반복 구간으로 맞춰야 한다.
# 5개씩 구간으로 보는 게 좋을 듯
# 1일 때는 11011 5개를 1개로
# 2일 땐ㄴ 11011 2개 00000 11011 2개
# 3일 때는  (11011 2개 00000 11011 2개) * 2 + 00000 * 5 +  (11011 2개 00000 11011 2개) * 2
# 4일 때는 또  ((11011 2개 00000 11011 2개) * 2 + 00000 * 5 +  (11011 2개 00000 11011 2개) * 2) * 2
# 이런식으로 이전 것이 반복 됨
# 즉 특정 n에서의 특정 l값은 범위에 따라서 어떤 거대한 수열 중 n이 1, 2, 3에 어느 부분에 위치했는지와 비슷함
# 그렇다면 비율을 줄이기를 해봄
# n이 2라면
# l을 5로 나눔
# 그러면 n=1일 때 l=0임
# 즉 11011에서 맨처음 1 자리에 있다는 소리
# r은 3.4 정도 이므로 11011에서 4번째 1구간이라는 소리
# 이제 다시 5를 곱하면....
# 아 아닌가...어떻게 구간에 맞춰서 구하지???? 
# 구간에서 1이 몇 개인가...
# 특정 구간을 11011에서 1은 4개
# 00000에서 1은 0개
# 11011 11011 00000 11011 11011 에서 1은 16개
# 000000000000000000 에서 1은 0개
# 이런 식으로 큰 구간을 5로 나눠보면서 구간에 1이 몇 개인지 세보고
# 어느 구간부터 어느 구간까지인지 큰 구간을 구하면
# 그 구간들 사이사이에 큰 공간은 전체 1은 구한 걸로 두고
# 작은 구간 침범하는 구간은 하나하나 세는 게 맞는 것 같은데...
# 난해하고 모르겠따.

def solution(n, l, r):
    def count_ones(level, x):
        if x <= 0:
            return 0
        
        if level == 0:
            return 1
        
        part_length = 5 ** (level - 1)
        part_ones = 4 ** (level - 1)
        
        if x <= part_length:
            return count_ones(level - 1, x)
        
        if x <= 2 * part_length:
            return (part_ones + count_ones(level - 1, x - part_length))
        
        if x <= 3 * part_length:
            return 2 * part_ones
        
        if x <= 4 * part_length:
            return (2 * part_ones + count_ones(level - 1, x - 3 * part_length))
        
        return (3 * part_ones + count_ones(level - 1, x - 4 * part_length))
    return count_ones(n, r) - count_ones(n, l - 1)
        