import math
def solution(w,h):
    # 이거는 정수 비로 떨어지는 것만 체크하면 될 듯
    # 일단 정사각형일 때는 즉 같은 비율일 때는 1개씩만 자르면 됨
    # 근데 m : n 비율이라면?
    # 3: 2인 경우 저렇게 3칸 내려갈 때 2칸임
    # 5: 2인 경우 5개 갈 때 2개 중요한 건 언제 넘기냐인데 2.5개 갈 때 1칸 넘김
    # 
    # 17 : 9는 17칸 갈 때 9개인데 17 / 9 = 1.xx 즉 1.xx마다 2개씩
    # 이를 일반화 하면 전체 w, h는 m * x, n * x 최대약수로 나눠짐
    # 일단 최대 공약수를 구하고 양변을 나눔
    # m과 n을 구하고 m칸 내려갈 때 n칸 오른쪽으로 가되
    # 9 : 2 하면 4.5칸 가다가 칸 바꿈 즉 5 + 5
    # 9: 8 하면 1. 1x마다 바꿈
    # 이거 보니까 1.1x마다 2개되는 게 그냥 가로 + 세로 -1 같네
    # 한 번 해 보자
    g = math.gcd(w, h)
    q = w // g
    k = h // g
    return ((w * h) - ((q + k - 1) * g))