def solution(targets):
    # 일단 실수도 가능하다는 점이 중요
    # 겹치는 놈들을 한 방에 잡는 점이 중요함
    # 50만개니까 n또는 n log n으로 끝내야 함
    # 일단 어떻게 가장 많이 겹치는 걸 지울까
    # 일단 s값이 작고 e값이 큰녀석들 순으로 정렬?
    # 아니다. 그냥 s값이 작고 e값이 작은 녀석
    # 모든 미사일 중 하나라도 맞으면 죽게 됨
    # 맨 왼쪽에서 가장 짧게 오는 녀석
    # 맨 왼쪽에 가장 짧은 녀석이랑 겹치는 녀석은 다 제거
    # 그 뒤 맨 왼쪽에서 가장 짧은 녀석이랑 겹치는 녀석도 다 제거를 반복
    # 이때 개구간이니까 정수는 못 잡고 범위로... s < x < e면 잡는 걸로
    # 근데 어떻게 표시할 것인가.
    # 일단 s가 가장 작은 놈 순으로 정렬했으니까, 다음에 오는 s가 e인 경우. 아예 범위 나가 버리는 경우는 
    # 이제 끝났다고 보고 그때부터 지우기
    # 마지막에 오면 +1하고 끝
    
    answer = 0
    
    targets.sort(key = lambda x:x[1])
    end = -1
    for s, e in targets:
        if s >= end:
            end = e
            answer += 1

    
    return answer