# 엄청 난해 하다!
# 일단 그런일은 없겠지만 완전 탐색으로 풀어보는 방식으로 접근해보면
# a의 부분수열은 a를 적절히 delete 한 것
# 그냥 a를 짝수가 되는 모든 경우의 수를 delete하고 in으로 모든 숫자를 비교?
# 일단 delete가 n
# n이 50만이니까 너무 큰 시간 복잡도 
# 그러면 순서를 지킨 조합으로?
# 50만 C 2, 50만C4 이런 거 반복은 너무 큰 수 같은데...
# 역순으로 생각
# 암거나 두개 다른 원소 나오게 일단 앞에서 부터 보고
# 뒤에 그 둘 중 하나가 포함 되는 거 2개가 있는지 보고
# 이거 반복 dp
# 근데 dp를 뭐 어떻게 짜야 하나? 감도 안 오네...
# 이것도 아닌 것 같은데
# 어떤 원소가 교집합의 개수가 1 이상이란 것은
# 전부다 한 원소가 들어간다.
# 즉 모든 원소의 종류를 계산 후 
# 각 원소들이 있는 위치에서 다음 위치 사이까지 뭐라도 하나씩 있으면
# 걍 뒤에 몇 개나 있든 신경 안 써도 됨
# 모든 원소들을 dic으로 개수 구하고
# 큰 거 부터 계산해 보면서
# 작은 원소들의 개수가 큰 거 교집합 보다 작으면 계산 안 하고 넘어가기?
# 오 이건 것 같은데
# 근데 구현을 뭐 어떻게 해야 하나
# 아니다 이거 해도 뭐 시간복잡도는 똑같이 n * n이다.
# 아니다 이러면 안 되는데........................
def solution(a):
    n = len(a)
    pair_count = [0] * n
    last_used = [-1] * n
    for i in range(n - 1):
        left = a[i]
        right = a[i + 1]
        if left == right:
            continue
        if last_used[left] < i:
            pair_count[left] += 1
            last_used[left] = i + 1
        if last_used[right] < i:
            pair_count[right] += 1
            last_used[right] = i + 1
    return max(pair_count) * 2