import heapq
def solution(n, times):
    # 최소공배수 느낌?
    # 아니다 이거 greed 인데 가장 적은 시간이 남는 곳에 할당하면 그만
    # 근데 할당 하기 졸라 귀찮게 100000명이나 해둠...
    # 심지어 사람은 짱 많음...
    # 이분탐색?
    # tree인가
    # 걍 최소값을 100,000개에서 1,000,000,000번 구하면 됨
    # heap 만들고 싹 다 넣고 heappop하고 끝나면 heappush
    # 아 근데 현재 시간 관리를 어떻게???
    # 일단 answer을 타임으로 ㄱㄱ
    # 아 근데 이거 어떻게? new 가 0이 될 때까지???
    # 그런데 이미 했던 걸 다시 넣는다면...최소가 되는 경우는 어떻게 처리? 1000, 7 있으면 7하고 1000하는 것보다
    # 7, 7, 7, ..., 7, 후 1000이 더 이득이잖아.
    # 아아아아 아니다
    # 시간이랑 상관 없이...걍 최소값 빼면 n-1 하고 최소값 다시 넣으면 되는 구나.
    # 값 저장만 해뒀다가 n -= 1해서 n=0 될 때 최소값 하면 되나???
    # 아 근데  그래도 1,000,000,000번 해야 되는데?
    # 최소공배수로 구하기???
    # 최소 공배수로 구하되 각 값을 최소공배수로 나눈 수 만큼을 n에서 빼기
    # 이거 근데 1 ~ 999 하고 갑자기 10000000000해버리면 완전탐색인데...
    # 와 어렵다. 모르겠다.
    
    
    # 가능한 최소 시간
    left =1
    # 가능한 최대 시간
    right = min(times) * n
    
    # 정답 후보
    answer = right
    
    while left <= right:
        # 현재 검사할 시간
        mid = (left + right) // 2
        
        # mid분 동안 모든 심사관이 처리할 수 있는 사람 수
        people = 0
        
        for time in times:
            people += mid // time
            # 이미 n명 이상 처리가 가능하면 더 계산x
            if people >= n:
                break
        if people >= n:
            answer = mid
            right = mid - 1
        else:
            left = mid + 1
    return answer
            