import math
def solution(k, d):
    #시간복잡도가 문제일 것 같다
    # d가 100만개라면...
    # k가 1이면 x축 100만 ~ 0, y축 100만 ~ 0
    # 즉 100*50*만*만/2인데
    # 2500억?
    # 절대 안 됨.
    # 일단 2차원이니까 전체의 딱 절반만 잘라서 구해도 됨
    # 데칼코마니처럼
    # 즉 y = x그래프로 절반
    #  정확히는 y = -x + d/k가 맞겠군
    # 그렇다면 단 순화 한다면
    # 처음 y =0이라 하면 d/k가 k의 간격으로 있으니까
    # 단순 d/k
    # 그뒤 k만큼 올라가면
    # y = k일때
    # (d-k)를 k의 간격으로니까
    # -1?이네
    # 1 2 3 = n(n-1)/2 3*2/2
    # 6 5 4 3 2 1 0
    # 아니네 입출력 2번 이상하다
    # 2, 4인데 왜 5 안 쪽이지?
    # 2, 3이어야 맞지 않나
    # 와 설마 제곱기준인가
    # 그렇다면 d/k하고
    # 그뒤 k만큼 올라올 때 k**2 + ? **2 <= d**2인 놈
    # 계속 k만큼 올리다가 끝에 올라간 크기가 k가 될때까지...
    # 이게 정답인가?
    # 이런 씹 고민만 23분이나 했네 걍 하자
    answer =0
    for x in range(0, d + 1, k):
        max_y = int(math.sqrt(d * d - x * x))
        answer += max_y // k+1
        
        
        
    
    return answer