from collections import defaultdict
import sys
sys.setrecursionlimit(10 ** 7)
# 1이상 10^12는 몇인가...
# 1000000000000 1조번
# 아니네 방번호는 20만개네
# 일단 무조건 dic일 듯?
# 근데 최악의 최악이라서 다 겹치면?
# 1, 1, 1, 1, 1, 1, 1, 이런식으로 20만개 하면
# n^2/2정도면 20만 * 20만 = 400억정도
# 줄여야 한다...
# 어떻게?
# 뭐 레벨 4니까 굉장한 방법이 있겠지만...
# 투숙 방을 범위로 구해야 하나.
# 이 범위는 이미 먹혔으니까 바깥으로 나가라고
# 근데 그런 범위를 리스트로 구현해도, 결국 많이 검색해야
# 예를 들어서 3~1000이 먹힘
# 그럼 3 ~ 1000을 전부 1001로 업데이트 해야함
# 그러면 똑같음...오히려 더 걸릴 수도
# 차라리..이분탐색?
# 어떤 수가 주어지고 그 방 번호가 이미 차버렸으면
# 현재 방을 left, 가장 큰 방을 right로 해서 구하기?
# 아 근데...10^12잖아. logn해도 10^6
# 차라리 20만이 2 * (10 ^ 5)라서 계산이 덜한가
# 아니지 이거 그렇게가 아니라...
# 원소들 값의 max + 20만으로 하면?
# 정확히는 room_number[i] 값 + len(roo_number)로
# 되기는 할 텐데 이거 1과 10^12가 있으면...
# 아 근데 원하는 방 번호 + 20만 하면 되겠네
# 그러네, 음. 그러면 20만 * 한 몇 백정도라서 되겠다
# 이분 탐색으로 근데 어떻게 하지?
# 일단 일반적으로 중간 값을 mid로 구하고 서치하는 이분탐색으로는 어려운 게
# 중간 값이 비어있으면
# 그 값보다 위로 가야 하나? 아래로 가야 하나? left 를 +1 해야 하나, 아니면 right -1 해야 하나
# 애매함.
# 중간값이 차있으면, 더 애매하고
# 그냥 이런 식으로 해야 하나?
# 중간 값이 차있으면 그 값이 어떤 식인지로 판별
# 만약 3인데 3은 이미 찼고 그 뒤 몇 개가 찼다면...
# 3과 100이 있을 때
# 46을 했는데 46이 50이라면 그 방이 이미 다 찼다는 뜻?
# 그러니까 어떤 숫자가 이미 차있으면 
# 오히려 리스트 처럼 넣기
# 리스트 맨 마지막 숫자부터 더하기
# 시간 오바. 정답은 unionfind
def solution(k, room_number):
    room_dic = {}
    len_room = len(room_number)
    answer = []
    
    def find(x):
        if x not in room_dic:
            room_dic[x] = x + 1
            return x
        empty = find(room_dic[x])
        room_dic[x] = empty + 1
        return empty
    for x in range(len_room):
        answer.append(find(room_number[x]))
    return answer