from functools import lru_cache
# 감도 안 오는 난감한 문제다
# 세로 1, 가로 2, 또는 세로 2 가로 1로 바꿔서 생각 가능하다
# 이게 dp처럼 되긴 어렵다.
# 근데 또 경우의 수는 무지하게 많다
# 그럼 dp일 확률이 높은데
# 한 직사각형을 그냥 n배 하는 건 불가능하다.
# 직사각형 2개를 붙이면 양 쪽에 1 두고 사이에 2개씩 생성
# 늘어난다. 경우의 수가!
# n이 홀수면 또 불가능한 가?
# 그렇다. 
# 그러면 n이 짝수면 (1, 2) (2, 1)로 n을 채우는 경우의 수를 구해야 하는데
# permutation?
# 근데 dfs 같은 거로는 안 되려나
# lru_cache써서
# 0, 0으로 시작해서 ~ (n = 3, n = 5000)
# 0, 0이 (1, 2), (2, 1) 2개 중 하나 선택 하고
# 1, 2 나 2, 1 선택하면 같은 열에서 아직 선택 안 한 곳을 2개 중 한개로 채우기
def solution(n):
    MOD = 1000000007
    if n % 2 == 1:
        return 0
    dp = [0] * (n + 1)
    dp[0] = 1
    if n >= 2:
        dp[2] = 3
    for width in range(4, n + 1 , 2):
        dp[width] = (4 * dp[width - 2] - dp[width - 4]) % MOD
    return dp[n]