def solution(a):
    # 일단 범위가 너무 커서 풀 수 없음
    # dp사용이 필요
    # 최후에 번호가 더 큰놈만 남기 또는 최후에 번호가 더 작은 놈(이전에 번호가 더 작은 풍선은 안 터트리기)
    # 불가능한 경우 --- 너무 작고 다른 거 오른쪽에 가면 갈 수록 큰놈들 사이에 작은 놈 한 개
    # 즉 숫자 기준 오른쪽 전부랑 왼쪽 전부를 봤을 때에 큰놈만 남으니까 왼쪽 가장 큰놈, 오른쪽 가장 큰놈만 남는다.
    # 이 때 오른쪽 가장 큰놈이랑 왼쪽 가장 큰놈이 더 작거나, 둘 중 1개만 크고 여태까지 작은놈 아끼면 성공
    # 아니면 실패
    # 3가지 경우로 볼 수 있을 듯.
    # 1번째 경우 더 작은 놈을 터트리는 방식을 쓰지 않고 가장 큰 수가 중간 놈 보다 작을 때
    # 2번째 경우 왼쪽 놈은 더 작은 놈 터트리는 방식 써야 되는 경우
    # 3번째 경우 반대
    # 즉, 왼쪽 모든 숫자가 중간 숫자보다 작고 오른쪽 모든 숫자가 중간숫자보다 커도
    # 왼쪽은 그냥 되고, 오른쪽은 필살기 써서 됨
    
    # 간단화 가능 이제.
    # 어떤 거 기준 제일 작은 거랑 큰거 비교
    # q랑 스택으로 한 개씩 빼서 비교
    # 근데 최대값 비교도 a가 100000000개라서 어렵...
    # 일단 왼쪽 max를 구하는 건 0부터 n까지 쭉 빼면서 최대값 비교 하고 리스트에 저장 100만번
    # 그 다음 오른쪽 max를 구하는 건 n일 때부터 쭉 빼면서 최대값 비교
    
    # 된 듯???
    # 아 문제 거꾸로 봤다 큰 놈을 터트리네
    
    left_min = []
    right_min = []
    r_min = 1000000001
    l_min = 1000000001
    for i in range(len(a)):
        if a[i] <= l_min:
            l_min = a[i]
        left_min.append(l_min)
        if a[len(a) - i - 1] <= r_min:
            r_min = a[len(a) - i - 1]
        right_min.append(r_min)
    right_min = right_min[::-1]
    answer = 0
    left_min = [1000000001] + left_min
    right_min = right_min + [1000000001]

    for i in range(len(a)):
        check = 0
        if a[i] > left_min[i]:
            check += 1
        if a[i] > right_min[i]:
            check += 1
        if check <= 1:
            answer += 1
    return answer